*&---------------------------------------------------------------------*
*& Report ZRSA12_11
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zrsa12_11.


DATA: gv_a TYPE sy-datum,
      gv_b LIKE gv_a,
      gv_c LIKE gv_a,
      gv_d LIKE gv_a.


"Cal Date 짧으면 주석달자. 주석다는 습관!
PERFORM cal_date USING sy-datum '7'
                 CHANGING gv_a.       "sy-datum 변수의 값을 던져준다 + 바뀌는 값 '7' 을 던져준다.
PERFORM cal_date USING sy-datum '14'
                 CHANGING gv_b.

PERFORM cal_date_new USING sy-datum '21'
                     CHANGING gv_c.

gv_c = sy-datum + 21.
gv_d = sy-datum + 28.

PERFORM display_info.


FORM cal_date USING VALUE(p_date)
                    VALUE(p_days)
              CHANGING VALUE(p_new_date). "위에서 던진 sy-datum 변수값을 p_date로 받는다! 바뀌는 값인 '7은 p_days로 받음!
 p_new_date = p_date + p_days.
ENDFORM.




*&---------------------------------------------------------------------*
*& Form display_info
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
FORM display_info .
WRITE: gv_a, gv_b, gv_c, gv_d.
ENDFORM.
*&---------------------------------------------------------------------*
*& Form cal_date
*&---------------------------------------------------------------------*
*& text
*&---------------------------------------------------------------------*
*& -->  p1        text
*& <--  p2        text
*&---------------------------------------------------------------------*
